#include <stdlib.h>

int main(){

  int request;
  int iter;

  printf("%s\n", "Hello, select the structure type\n1: net_device\n2: pci_dev");

  scanf("%d", &request);

  if (request == 1){
    iter = system("echo 1 >> /sys/kernel/debug/request");
  } else if (request == 2){
    iter = system("echo 2 >> /sys/kernel/debug/request");
  }

  int r = system("cat /sys/kernel/debug/request");

  return r;
}

### Набор инструкций

| Syntax    | Mnemonic | Arguments        | Comment                                                                       |
|:----------|:---------|------------------|-------------------------------------------------------------------------------|
| `defvar`  | movv     | addr, value      | Устанавливает значение $2 по данному адресу $1                                |
| `setq`    | mov      | addr             | Загружаем значене из AC в $1                                                  |
| `mod`     | mod      | addr, value      | Сохраняет в AC остаток от деления значения по адресу $1 на $2                 |
| `=`       | bne      | value, addr      | Аналог if. Если AC != $1, то прыгаем на $2                                    |
| `+`       | add      | addr, addr       | Сложить значения, лежащие по адресам $1 $2, результат в AC                    |
| `dotimes` | loop     | addr, addr, addr | Если значение по адресу $3 < значение по адресу $2, то переходим по адресу $1 |                                                                 ||                | jz       | 2                | переход, если в текущей ячейке 0                                              |
|           | halt     | 0                | остановка                                                                     | 
| `print`   | print    | addr             | Вывод знаения по адресу $1                                                    |


``` text
                             +--------------+  addr   +--------+
        +------------------->| data_address |---+---->|  data  |
        |                    +--------------+         | memory |
        |                                             |        |
        |                                             |        |
        |                                             |        |
        |                                             |        |
        |                                     data_in |        | data_out            output
        |            +------------------------------->|        |-------+-------------------->
        |            |                                |        |       |
        |            |                             oe |        |       |
        |            |                            --->|        |       |
        |            |                                |        |       |
        |            |                             wr |        |       |
        |            |                            --->|        |       |
        |            |                                +--------+       |
        |            |                                                 v
        |            |                                             +--------+     sel
        |            |                                             |  imux  | <---------+
        |    sel +-------+                                         +--------+           |
        |      +>|  mux  |                                           |    |             |
        |      | +-------+                    alu                    |    |             |
        |      |  |    |       latch         /----|                  |    |             |
        |      |  |    |     +--------+      |    |<------------------+    +-------+     |
input   |      |  |    |     |        |      |   /                                 |     |       
------------------+    +-----|   AC   | <--- |   \                                 |     |   
        |      |             |        |      |    |<--+    latch                   |     |        
        |      |             +--------+      \----|    | +--------+       +----+   |     |
        |      |              |      |      sel |      | |        |       |    |<--+     |
        |      |         zero |  neg |          |      +-|   DR   | <---- |imux|         |         
        |      |              |      |          |        |        |       |    |<--+     |             
        |      |              |      |          |        +--------+       +----+   |     |              
        |      |              |      |          |                            |  i.d|     |        
        |      |              |      |          |                        sel | data|     |        
        |      |              |      |          |                            |     |     |        
   +----------------------------------------------------------------------------------------+                                                                                   
   |                                                                                        | 
   |                                    Instruction decoder                                 |
   |                                                                                        |
   +----------------------------------------------------------------------------------------+
                                                                                      
```




```
   +----------------------------------------------------------------------------------------+                                                                                   
   |                                                                                        | 
   |                                    Instruction decoder                                 |
   |                                                                                        |
   +----------------------------------------------------------------------------------------+
     |     |                                                                |                                  
     |     |                                                                | cur                                 
 new |     |                                                                |instr                                  
addr |     |                                                                |                                  
     |     | sel                                                            |                                      
     |   +---+             +-----------------+                      +----------------+                                                
     +-->|   |             |                 |                      |                |                                       
         |mux| ----------> | program counter |-------+------------> | program memory |                                                                         
     +-->|   |             |                 |       |              |                |                                        
     |   +---+             +-----------------+       |              +----------------+                                                                 
     |              +1                               |                                                        
     +-----------------------------------------------+                                                                                          
                                                                                                            
                                                                                                            
                                                                                                            
                                                                                                            
   
   
   
   
   
   
   
   

```